[
  {
    "Id": 1,
    "Name": "Magnesium Carbonate Gym Chalk Blocks",
    "ShortDescription": "Bodyquest Gymnastic chalk from Magnesium carbonate\n\nPerfect for gymnastics, calisthenics, weightlifting, CrossFit, climbing.\nIn blocks of 60g\n8 blocks per box.\nSold per block individually or per box.",
    "LongDescription": "Bodyquest Gymnastic chalk from Magnesium carbonate\n\nOur magnesium is perfect for gymnastics, calisthenics, weightlifting, CrossFit, climbing. This is one of the most important accessories for successful training with less skin injuries.\nIn blocks of 60g\n8 blocks per box.\nSold per block individually or per box.",
    "Price": 3.9,
    "PictureUrl": "https://res.cloudinary.com/dotnetdari/image/upload/v1591984817/bodyquest/w1de02r73txaz3cqulxf.jpg",
    "GrossWeight": 0.06
  },
  {
    "Id": 2,
    "Name": "Bodyquest Gymnastic Wooden Rings",
    "ShortDescription": "The gymnastic rings are one of the simplest and most effective tools for building a huge upper body strength, but also for physiotherapy and rehabilitation of injuries. A great deal of exercise can be performed by beginners as well as by advanced and professional athletes.\n\nThickness of the wooden ring: 28mm\nOuter diameter of the rings: 23 cm\nNylon straps dimensionsions: width 3cm, length 4m\nMaximum load: about 300 kg\nMaterial of the rings: birch\nWeight : 1.7kg",
    "LongDescription": "High quality gymnastic rings\n\nThe gymnastic rings are not only one of the simplest and most effective tools for building a huge upper body strength, but also for physiotherapy and rehabilitation of injuries.\nA great deal of exercise can be performed for beginners as well as for advanced and professionals.\n\nSpecifications:\n\n    Thickness of the wooden ring: 28mm (the Olympic standard size is 28mm).\n    Outer diameter of the rings: 23 cm\n    Nylon straps dimensionsions: width 3cm, length 4m\n    Maximum load: about 300 kg\n    Material of the rings: birch\n    Weight : 1.7kg",
    "Price": 54,
    "PictureUrl": "https://res.cloudinary.com/dotnetdari/image/upload/v1592604842/bodyquest/ydlmjgwqd6zbsgtefuxo.jpg",
    "GrossWeight": 1.7
  },
  {
    "Id": 3,
    "Name": "Bodyquest Gymnastic Hand Grips",
    "ShortDescription": "This is the most precious and valuable tool in your CrossFit arsenal!\nOur BODYQUEST Grips are made from top grade leather with Velcro wrist straps.\nThe grips are designed to make your hands happy.\nThey are in four different sizes- S, M, L, XL.\n\nBODYQUEST Grips allow you to train harder and longer by offering you better comfort, improving your grip and protecting your hands from getting blisters thus preventing the long healing process of your injured hands. Blistered hands required about a week to recover, during that time you can't do much with your hands.\n\nThe BODYQUEST Grips are PERFECT for gymnastic ring training, gymnastic stall bar and parallel bar training, pull-ups, muscle-ups, O-lifts, kettlebells etc.",
    "LongDescription": "The BODYQUEST Grips are made from top grade leather with Velcro wrist straps.\nThey are in four different sizes- S, M, L, XL.\n \nThe design of the BODYQUEST Grips will allow you to train harder and longer by offering you better comfort, improving your grip, protecting your hands from being torn up thus preventing the long healing process of your injured hands.\n \nThe BODYQUEST Grips are PERFECT for gymnastic ring training, gymnastic stall bar and parallel bar training, pull-ups, muscle-ups, O-lifts, kettlebells etc.\n \nSpecifications:\n\n    100% High Quality Design and Construction, product is Brand New\n    Adjustable and very comfortable Velcro fastener ensures a secure grip\n    Length: Small, Medium, Large or X Large (see sizing details below)\n    Velcro strap widht: 1.5 inches\n    Width: 2.5 inches / 6.5 centimetres\n    Colour: White\n    Material: Genuine Leather\n\n \nSizing:\nThe BODYQUEST Grips come in four sizes.\nTo determine your correct size measure from your wrist to the base of your fingers and based on your measurements your correct sizing is as follows:\nSmall - Fits between 8 centimeters and 9.5 centimeters\nMedium - Fits between 9.5 centimetres and 10.5 centimetres\nLarge - Fits between 10.5 and 11.5 centimetres\nXLarge - Fits between 11.5 and 13 centimetres\nIt is important to purchase the correct size BODYQUEST Grip.\nIf your hand is right between sizes, select the bigger one!\n \nThe finger holes may be too small for some athletes but can be stretched slightly.\nIf the finger holes are too small, DO NOT CUT them, instead simply roll up a piece of sandpaper and sand the holes until you reach the size required.\nHow To Use:\n\n    Put plenty of magnesium carbonate on your hands before using the grips\n    Put on the grips by matching the two holes into your middle finger and ring finger\n    Strap the velctro around the wrists. If you like, use sweat bands bellow the straps (just like the gymnasts do)\n    Add plenty of magnesium carbonate on the leather part of the grips and also on your fingers\n    crush the WOD\n\nPackage Includes:\n1 x Brand NEW Pair of BODYQUEST Grips\n1 x Plastic Storage Bag",
    "Price": 16,
    "PictureUrl": "https://res.cloudinary.com/dotnetdari/image/upload/v1605529699/bodyquest/Gymnastic-grips_lo5ssj.jpg",
    "GrossWeight": 0.15
  },
  {
    "Id": 4,
    "Name": "Bodyquest Wrist Strength Wraps",
    "ShortDescription": "Comfortable. Supportive. Beautiful.\n\nThe strength wrist wraps are light and breathable support for your hands and wrists.\nThey are a radical simplification in design and function and are a significant improvement in wrist support.\n\nTheir outstanding comfort makes them ideal for gymnastics regarding handstand training for example. They are an excellent choice for weightlifting beginners when learning Olympic weightlifting and doing front squats. The pain in your wrists will be significantly decreased until they adapt to the stress they have to handle. The connective tissues of your body require time for physiological adaptation no matter how you train. The wrist wraps give you safety and comfort in your training allowing those adaptations to occur without injuries and inflammations.\nColor\n\t\nBodyquest Wrist Strength Wraps quantity\n+ Add to Wishlist loading\nSKU: N/A Categories: ACCESSORIES, ACCESSORIES, BESTSELLERS, STRAPS, WRAPS & SLEEVES\n\n    Product Description Additional Information Reviews (0)",
    "LongDescription": "The BODYQUEST wrist wraps are a great alternative for an athlete that doesn't prefer the bulkiness of a traditional lifting wrap.\nThey are lightweight, durable and beautiful with their superb color combinations.\n\nHow to properly use them:\n\n    Start wrapping the wrap around your wrist by putting the colorful side stitching towards your fingers.\n    Keep wrapping nice and easy and keep the wrap high on the wrist.\n    Continue until you get to the string.Wrap around and go underneath it once. Continue to wrap it around and put it back and underneath on the opposite side of the wrist once again.\n    Once you have the string positioned and secured just grab the wrap with your free hand and twist the wrap in the direction it was wrapped.\n    Twist until you find it tight enough. This self-tightening is very easy and smart way of controlling the tightness and support on your wrist.\n\nThis is a great tool for your training but don't always depend on it. Try to train with it and sometimes without it.\nThe point is to gain strength in your wrists while doing great WODs but with additional comfort thanks to the wrist wraps and on the other side not being fully dependent on them.\n\nSpecifications:\n\n    Material: Ripstop Cotton Blend - 65% cotton and 35% polyester.\n    A great combination for moisture wicking and quick drying.\n    Length: 33? (84cm)\n    String Length: ~ 14? (35cm)\n    Width: 3.25? (8.3cm)\n    Weight: ~ 65g",
    "Price": 16,
    "PictureUrl": "https://res.cloudinary.com/dotnetdari/image/upload/v1598889487/bodyquest/r9wxffxaazf2orjne0ix.jpg",
    "GrossWeight": 0.07
  },
  {
    "Id": 5,
    "Name": "Bodyquest Men's Performance X Bar 20KG",
    "ShortDescription": "Bold.Performing.Strong.\nThe coolest barbells since barbells have been invented.\n\nThis is a multi-purpose bar with dependable performance that sets it head and shoulders above the rest.\nThe Bodyquest Performance X Bar has a unique polymer-ceramic composite coating developed in the military.\nIts main purpose is superb resistance to abrasion, wear and corrosion- over 100-150x more resistant than stainless steel!\nThe most obvious purpose though is the bold and cool empowering looks.\nCoupled with its resistance to corrosion the bar will keep its outstanding looks for years.",
    "LongDescription": "Game changing innovation for the good old olympic barbell.\nThe X Bar features 190,000 PSI tensile strength shaft, dual knurl marks and high quality needle bearings for outstanding spin and performance.\nThis is a multi-purpose bar with dependable performance that sets it head and shoulders above the rest.\nIts main purpose is superb resistance to abrasion, wear and corrosion- over 100-150x more resistant than stainless steel!\nCoupled with its resistance to corrosion the bar will keep its outstanding looks for years.\nSpecifications:\n\nBrand: Bodyquest\nBar Type: Men's Bars\nBar Use: Multipurpose, Weightlifting, Olympic Weightlifting, Powerlifting\nDiameter: 28mm\nWeight: 20kg\nBearing: 8 needle bearings\nShaft coating: ceramic-polymer composite\nSleeves' coating: black chrome\nDual Knurl Marks for Oly and Power lifts\n190,000 PSI Tensile Strength Steel\nMaximum Load: 900kg\n\nPlease Note: The Cerakote coating has an excellent resistance to corrosion, but metal-to-metal contact, particular on the sleeves, can still cause wear over time. For the best long term results, some cleaning and maintenance may be required.\nThe Bodyquest Bar Care\n\nThis bar will require some maintenance on a regular basis.\nThe ceramic-polymer coating is a strong protection against oxidization\nThe following maintenance is recommended to keep the bar steel healthy:\n1) Use a plastic bristle brush and a mild detergent to clean the knurl\n2) Wipe down with WD40 or 3:1 oil and brush into the knurl with plastic bristle brush. The steel will soak the oil in and the bar will stay healthy\n3) Wipe off any excess oil with a dry towel",
    "Price": 345,
    "PictureUrl": "https://res.cloudinary.com/dotnetdari/image/upload/v1589045907/bodyquest/hf0wgbzog3owmoasivjb.jpg",
    "GrossWeight": 21
  }
]